In [8]:
from students import AdmittedStudents

In [9]:
students = AdmittedStudents(csv_file='students_list.csv')
students.admitted_students

       firstname   lastname
id
300000     Aimil      Hoban
300001       Max      Teryn
300002      Aili      Taima
300003     Talya  Pettiford
300004      Inga  Hortensia
...          ...        ...
300095   Adriana      Yusuk
300096      Alex      Zrike
300097     Aimil  Whittaker
300098  Cherilyn     Oriana
300099      Shel       Ovid

[100 rows x 2 columns]

In [10]:
students.add_student(303030, 'Dwight', 'Schrute')
students.admitted_students

       firstname   lastname
300000     Aimil      Hoban
300001       Max      Teryn
300002      Aili      Taima
300003     Talya  Pettiford
300004      Inga  Hortensia
...          ...        ...
300096      Alex      Zrike
300097     Aimil  Whittaker
300098  Cherilyn     Oriana
300099      Shel       Ovid
303030    Dwight    Schrute

[101 rows x 2 columns]

In [11]:
students.validate_student(303030)

1

In [12]:
students.delete_student(303030)
students.admitted_students

       firstname   lastname
300000     Aimil      Hoban
300001       Max      Teryn
300002      Aili      Taima
300003     Talya  Pettiford
300004      Inga  Hortensia
...          ...        ...
300095   Adriana      Yusuk
300096      Alex      Zrike
300097     Aimil  Whittaker
300098  Cherilyn     Oriana
300099      Shel       Ovid

[100 rows x 2 columns]

In [13]:
students.validate_student(303030)

0

In [14]:
students.export_students_to_csv('exported_students_list.csv')